import React from 'react';

const Blog = () => {
    return (
        <div className='container'>
            <h1>Difference between authorization and authentication</h1>
            <p>
                Authentication ব্যবহারকারী কে তা যাচাই করে।পাসওয়ার্ড, ওয়ান-টাইম পিন এবং ব্যবহারকারীর দ্বারা প্রদত্ত বা প্রদত্ত অন্যান্য তথ্যের মাধ্যমে Authentication কাজ করে।Authentication ব্যবহারকারীর দ্বারা দৃশ্যমান এবং আংশিকভাবে পরিবর্তনযোগ্য।Authentication একটি ভাল পরিচয় এবং অ্যাক্সেস ব্যবস্থাপনা প্রক্রিয়ার প্রথম ধাপ।
            </p>
            <p>
                Authorization নির্ধারণ করে কোন ব্যবহারকারী কোন রিসোর্স অ্যাক্সেস করতে পারে। Authorizationসেই সেটিংসের মাধ্যমে কাজ করে যা সংস্থার দ্বারা বাস্তবায়িত এবং রক্ষণাবেক্ষণ করা হয়। Authorization ব্যবহারকারীর কাছে দৃশ্যমান বা পরিবর্তনযোগ্য নয়। Authorizationব্যবহারকারীর কাছে দৃশ্যমান বা পরিবর্তনযোগ্য নয়।
            </p>
            <h1>Why are you using firebase?</h1>
            <p>যখন আপনার অ্যাপ্লিকেশানগুলির জন্য লিগ্যাসি সিস্টেম বা তৃতীয় পক্ষের পরিষেবাগুলির সাথে ন্যূনতম স্তরের একীকরণের প্রয়োজন হয়, তখন ফায়ারবেস হবে সঠিক পছন্দ৷ ফায়ারবেস হল একটি সম্পূর্ণরূপে পরিচালিত ব্যাকএন্ড পরিষেবা যা আপনাকে আপনার ওয়েব অ্যাপগুলির জন্য সর্বোত্তম-শ্রেণীর পরিকাঠামো দেয়, ব্যবহারকারীর প্রমাণীকরণ এবং সার্ভার স্কেলিং থেকে ক্র্যাশ বিশ্লেষণ এবং একটি নির্ভরযোগ্য পরীক্ষার পরিবেশ সবকিছু পরিচালনা করে৷</p>
            <h1>What other options do you have to implement authentication?</h1>
            <p>আপনি যদি ফায়ারবেস Authentication ব্যবহার না করেন, তাহলে প্রতি-ব্যবহারকারী অ্যাক্সেসের জন্য নিরাপদ কোনো সমাধান নেই। আপনার যদি একটি ভিন্ন Auth সিস্টেম থাকে, তাহলে আপনাকে একটি কাস্টম প্রমাণীকরণ Auth ব্যবহার করে Firebase এর সাথে একীভূত করতে হবে।</p>
            <h1> What other services does firebase provide other than authentication</h1>
            <p>ফায়ারবেস স্টোরেজ ব্যবহার করার জন্য আমাদের ফায়ারবেস  authenticate মাধ্যমে একজন ব্যবহারকারীকে  authentication করতে হবে। ডিফল্ট নিরাপত্তা নিয়ম ব্যবহারকারীদের  authenticated প্রয়োজন. ফায়ারবেস স্টোরেজ মূলত একটি শক্তিশালী এবং সহজ অবজেক্ট স্টোরেজ, যেখানে আপনি সহজেই আপনার ফাইল সংরক্ষণ করতে পারেন। এই নির্দিষ্ট ব্যবহারের ক্ষেত্রে আপনি Firebase authentication  anonymous authentication প্রদানকারী ব্যবহার করতে চাইবেন। এটি মূলত একই কাজ করে যেমন আপনি এখন করেন। পার্থক্য হল আপনি anonymous authentication ব্যবহারকারীকে পরবর্তীতে তাদের Facebook/Google/Github/ইমেল অ্যাকাউন্ট লিঙ্ক করে চিহ্নিত ব্যবহারকারীর কাছে আপগ্রেড করতে পারেন।</p>

        </div>
    );
};

export default Blog;